БИТУправление_медицинским_центром_демо/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <resources>
    <name>ВестиУчетДлительностиРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСертификаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетРасходаМатериаловНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьПроведениеПродажиНоменклатурыБезДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойПрейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <resources>
    <name>ПрейскурантРасчетаСтоимостиМатериалов</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <resources>
    <name>ШиринаКолонкиРаботыЖурналаЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаСтрокиЖурналаЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНесколькоСотрудниковВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеПереключателяНесколькихСотрудниковВЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьШтрихкодированиеКлиентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСтраховыеПолисы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойЦветЗаявки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяСтатьяДДСОказанияУслуг</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуПоНулевойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписыватьПартииВМинус</name>
    <comment>0 - проводить, не списывая в минус; 1 - проводить в минус;  2 - отказ проведения; 3 - проводить только документы оказания услуг в минус</comment>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключатьНормативныеМатериалыВСтоимостьУслуг</name>
    <comment>Значение для подстановки в записи регистра &quot;Нормы расхода материалов&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиЗаполнятьНормыРасходаМатериаловОУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиЗаполнятьНормыРасходаМатериаловПриема</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РедактироватьДатуНачалаДействияСертификатаПриПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтноситьСписаниеНаЗатратыПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяСтатьяЗатратСписанияТоваров</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрашиватьПричинуЗакрытияЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретНезаполненияХарактеристик</name>
    <comment>Запретить не указывать в документах характеристику для номенклатуры, по которой ведется учет по характеристикам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокОкругленияПослеСкидки</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСекцииККМ</name>
    <comment>Относить сумму чека ККМ на различные секции ККМ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранитьФотоКлиентовКакФайлы</name>
    <comment>Использовать файловый вариант хранения фото</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйРазмерФайлаФото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьЗакладкуSMSСообщенийВКалендареПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьАртикул</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаСводногоОтчетаЗаСутки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойЦветНерабочегоВремени</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОтдельнаяКолонкаРабочегоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидПредставленияФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоУмолчаниюРучноеРедактированиеСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимЗаписиНаПрием</name>
    <type>
      <types>EnumRef.РежимыЗаписиНаПрием</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонАнамнезаЖизни</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиШтрихкодироватьМедицинскиеКарты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетМестонахожденияМедкарт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УменьшатьВыработкуПриВозврате</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоСозданиеМедкарт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойВидМедКарт</name>
    <type>
      <types>CatalogRef.ВидыМедицинскихКарт</types>
    </type>
  </resources>
  <resources>
    <name>РаботаСЗубнымиКартами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтображатьКолонкуЖЗДлительностиИнтервала</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПроверкиДублейКлиентов</name>
    <type>
      <types>EnumRef.РежимыПроверкиДублейКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>РежимПечатиПоШаблонуWORD</name>
    <type>
      <types>EnumRef.РежимыПечатиПоШаблонуWORD</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛистыОжиданияЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодАвтообновленияЖурналаЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеСканированиеФайлов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтбораЖурналаЗаписиПоМоделямРасписания</name>
    <comment>Ложь - по подразделениям, Истина - по моделям расписания</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоУмолчаниюПодборСубъектовВЖурналЗаписиПоСтруктуреОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазворачиватьДеревоСубъектовРасписанияПриПодбореВЖурналЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазворачиватьДеревоМоделейРасписанияПриПодбореВЖурналЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьЖурналЗаписиБезОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьВЖурналЗаписиУчастниковБезМоделейРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьCallЦентр</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяРежимВводаПриемаПоОдномуШаблону</name>
    <comment>Истина - для всех пользователей, Ложь - согласно настройке пользователя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрофосмотры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьМедосмотрыСправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЭЦП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВерсионированиеШО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаПолейСубъектаЭЦП</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>МинДлинаСтрокиПоискаКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РежимЗаполненияДиагнозовПоПервичномуПриему</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьОказаниеУслугСПриоритетомИсходныхДанныхЗаявки</name>
    <comment>Истина - Данными заявки; Ложь - Данными приемов по этой заявке, если в них есть данные о выполненных услугах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиШтрихкодироватьПрМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПоХарактеристикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеВЧекеККМОперацииПополненияБаланса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧекККМПродажаПечататьУслугиОднойСтрокой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧекККМПродажаОбщееНаименованиеУслуг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧекККМПродажаПечататьФИОКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьХозяйственныйБлок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАнкетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяСуммаДолгаКлиента</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/УчетнаяПолитикаРасширенная/УчетнаяПолитикаРасширенная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаРасширенная</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ТрудовыеРоли</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
      <types>CatalogRef.ОбработкиSMSрассылки</types>
      <types>CatalogRef.СтраныМира</types>
      <types>CatalogRef.НастройкиОбменаССайтом</types>
      <types>Boolean</types>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
      <types>CatalogRef.ВидыМедицинскихКарт</types>
      <types>EnumRef.МедосмотрыПравилаОпределенияНеЗавершивших</types>
      <types>String</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>Number</types>
      <types>EnumRef.ВидыОплаты</types>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>EnumRef.ПараметрыУчетнойПолитики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиСотрудников/НастройкиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиСотрудников</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>Наличными</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>Сертификатом</name>
  </enumValues>
  <enumValues>
    <name>ЗаСчетФирмы</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/CommonModules/УправлениеНастройками/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру значений учетной политики
//
// Параметры:
// 	ИспользоватьКеш - Булево - следует ли использовать кеш значения.
//
// Возвращаемое значение:
//  Структура - Структура с параметрами учетной политики.
//
Функция ПолучитьУчетнуюПолитику(ИспользоватьКеш = Истина) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	СрокЖизниКеша = 3600;
	
	Если ИспользоватьКеш = Истина 
		И (Не ПараметрыСеанса.УчетнаяПолитика.Свойство("ДатаОбновленияДанныхПараметраСеанса")
			Или (ПараметрыСеанса.УчетнаяПолитика.ДатаОбновленияДанныхПараметраСеанса + СрокЖизниКеша) > ТекущаяДата())
	Тогда
	    мУчетнаяПолитика = Новый Структура(ПараметрыСеанса.УчетнаяПолитика);
		
		Если мУчетнаяПолитика.Количество() < 2 Тогда
			мУчетнаяПолитика = ПолучитьУчетнуюПолитику(Ложь);
		КонецЕсли;
		
		Возврат мУчетнаяПолитика;
	Иначе
		
		нзУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
		нзУчетнаяПолитика.Прочитать();
		
		мУчетнаяПолитика = Новый Структура;
		
		Если нзУчетнаяПолитика.Количество()<>0 Тогда
			
			мУчетнаяПолитика = Новый Структура;
			мМетаданныеРесурсы = Метаданные.РегистрыСведений.УчетнаяПолитика.Ресурсы;
			Для Каждого Ресурс Из мМетаданныеРесурсы Цикл
				мУчетнаяПолитика.Вставить(Ресурс.Имя, нзУчетнаяПолитика[0][Ресурс.Имя]); 
			КонецЦикла;

		Иначе
			мУчетнаяПолитика = ПолучитьУчетнуюПолитикуПоУмолчанию();                                         
		КонецЕсли;
		
		ПроцедурыСпециализацииПоставки.ДополнитьУчетнуюПолитикуНастройкамиУзла(мУчетнаяПолитика);
		ДополнитьУчетнуюПолитикуРасширеннымиНастройками(мУчетнаяПолитика);
		
		мУчетнаяПолитика.Вставить("ДатаОбновленияДанныхПараметраСеанса", ТекущаяДата());
		
		УправлениеНастройкамиПереопределяемый.ПриПолученииУчетнойПолитики(мУчетнаяПолитика);
		
		ПараметрыСеанса.УчетнаяПолитика = Новый ФиксированнаяСтруктура(мУчетнаяПолитика);
		
	КонецЕсли;
	
	Возврат мУчетнаяПолитика;
	
КонецФункции

// Добавляет в учетную политику значения расширенных настроек.
//
// Параметры:
//  мУчетнаяПолитика - Структура - Структура со значениями параметров учетной политики, 
//                                 в качестве ключа используется имя параметра.
//
Процедура ДополнитьУчетнуюПолитикуРасширеннымиНастройками(мУчетнаяПолитика) Экспорт
	
	нзУчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаРасширенная.СоздатьНаборЗаписей();
	нзУчетнаяПолитика.Прочитать();
	тзУчетнаяПолитика = нзУчетнаяПолитика.Выгрузить();
	
	пчПараметры = Перечисления.ПараметрыУчетнойПолитики;
	
	ИменаПараметровХранилищеЗначения = УправлениеНастройкамиПовтИсп.ПолучитьПараметрыУчетнойПолитикиРасширеннойХранилищеЗначений();
	
	Для Каждого МетаданныеПараметра Из Метаданные.Перечисления.ПараметрыУчетнойПолитики.ЗначенияПеречисления Цикл
		
		ИмяПараметра = МетаданныеПараметра.Имя;
		Параметр = пчПараметры[ИмяПараметра];
		СтрокаУП = тзУчетнаяПолитика.Найти(Параметр, "Параметр");
		
		Если СтрокаУП = Неопределено Тогда
			Значение = ПолучитьЗначениеПараметраУчетнойПолитикиРасширеннойПоУмолчанию(ИмяПараметра);
		ИначеЕсли ИменаПараметровХранилищеЗначения.Найти(ИмяПараметра) <> Неопределено Тогда
			Значение = СтрокаУП.ХранилищеЗначения;
		ИначеЕсли СтрокаУП.Значение = Неопределено Тогда
			Значение = ПолучитьЗначениеПараметраУчетнойПолитикиРасширеннойПоУмолчанию(ИмяПараметра);
		Иначе
			Значение = СтрокаУП.Значение;
		КонецЕсли;
		
		мУчетнаяПолитика.Вставить(МетаданныеПараметра.Имя, Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает значение параметра учетной политики.
//
// Параметры:
//  ИмяПараметра - Строка	 - имя параметра
//  Дата		 - Дата	 - не используется.
// 
// Возвращаемое значение:
//  Произвольный - определяется типом значения параметра.
//
Функция ПолучитьПараметрУчетнойПолитики(ИмяПараметра, Дата = Неопределено) Экспорт 
	
	мУчетнаяПолитика = ПолучитьУчетнуюПолитику();
	Возврат мУчетнаяПолитика[ИмяПараметра];
	
КонецФункции

// См. ПолучитьПараметрУчетнойПолитики().
Функция ПараметрУчета(ИмяПараметра) Экспорт
	Возврат ПолучитьПараметрУчетнойПолитики(ИмяПараметра);
КонецФункции

// Возвращает структуру значений учетной политики по умолчанию
//
// Возвращаемое значение:
//  Структура - Структура с параметрами учетной политики.
//
Функция ПолучитьУчетнуюПолитикуПоУмолчанию()
	
	мМетаданные	= Метаданные.РегистрыСведений.УчетнаяПолитика.Ресурсы;
	СтруктураВозврата = Новый Структура;
	Для Каждого Реквизит из мМетаданные Цикл
		
		СтруктураВозврата.Вставить(Реквизит.Имя, ПолучитьЗначениеПараметраУчетнойПолитикиПоУмолчанию(Реквизит.Имя));
		
	КонецЦикла;
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает значение параметра учетной политики по умолчанию.
//
// Параметры:
//  ИмяПараметра - Строка	 - имя параметра.
// 
// Возвращаемое значение:
//  Произвольный - определяется типом значения параметра.
//
Функция ПолучитьЗначениеПараметраУчетнойПолитикиПоУмолчанию(ИмяПараметра) Экспорт
	
	Если ИмяПараметра = "ОсновнойВидОплаты" Тогда                                                   
		Возврат Перечисления.ВидыОплаты.Наличными;                                                 
	ИначеЕсли ИмяПараметра = "ПериодичностьПланирования" Тогда                                    
		Возврат Дата(1,1,1,0,15,0);
	ИначеЕсли ИмяПараметра = "ШиринаКолонкиРаботыЖурналаЗаписи" Тогда                                    
		Возврат 20;          
	ИначеЕсли ИмяПараметра = "ВремяНачалаРаботы" Тогда
		Возврат Дата(1,1,1,9,0,0);
	ИначеЕсли ИмяПараметра = "ВремяОкончанияРаботы" Тогда
		Возврат Дата(1,1,1,21,0,0);
	ИначеЕсли ИмяПараметра = "ИспользоватьСертификаты" Тогда
		Возврат Ложь;
	ИначеЕсли ИмяПараметра = "ИспользоватьСкидки" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ПоУмолчаниюРучноеРедактированиеСкидок" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ВестиУчетДлительностиРабот" Тогда       
		Возврат Ложь;
	ИначеЕсли ИмяПараметра = "ВестиУчетПоХарактеристикам" Тогда
		Возврат Ложь;
	ИначеЕсли ИмяПараметра = "ВестиУчетРасходаМатериаловНаУслуги" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ИспользоватьНесколькоСотрудниковВДокументах" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ОсновноеЗначениеПереключателяНесколькихСотрудниковВЗаявке" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ИспользоватьШтрихкодированиеКлиентов" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ОсновнойЦветЗаявки" Тогда
		Возврат Новый ХранилищеЗначения(ПолучитьЦветЗаявкипоУмолчанию());
	ИначеЕсли ИмяПараметра = "СписыватьПартииВМинус" Тогда
		Возврат 3;
	ИначеЕсли ИмяПараметра = "ВключатьНормативныеМатериалыВСтоимостьУслуг" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "РедактироватьДатуНачалаДействияСертификатаПриПродаже" Тогда
		Возврат Истина;          
	ИначеЕсли ИмяПараметра = "АвтоматическиЗаполнятьНормыРасходаМатериаловОУ" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "АвтоматическиЗаполнятьНормыРасходаМатериаловПриема" Тогда
		Возврат Ложь;
	ИначеЕсли ИмяПараметра = "ВалютаУчета" Тогда
		Возврат Справочники.Валюты.Рубль; 
	ИначеЕсли ИмяПараметра = "РазрешитьПродажуПоНулевойСтоимости" Тогда
		Возврат Истина; 
	ИначеЕсли ИмяПараметра = "ПорядокОкругленияПослеСкидки" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр0_01; 
	ИначеЕсли ИмяПараметра = "ПоказыватьАртикул" Тогда
		Возврат Истина;        
	ИначеЕсли ИмяПараметра = "ОсновнойЦветНерабочегоВремени" Тогда
		Возврат Новый ХранилищеЗначения(ПолучитьЦветНерабочегоВременипоУмолчанию());
	ИначеЕсли ИмяПараметра = "ВидПредставленияФИО" Тогда
		Возврат "Фамилия Имя Отчество";
	ИначеЕсли ИмяПараметра = "УменьшатьВыработкуПриВозврате" Тогда       
		Возврат Истина; 
	ИначеЕсли ИмяПараметра = "РежимЗаписиНаПрием" Тогда
		Возврат Перечисления.РежимыЗаписиНаПрием.КВрачу;
	ИначеЕсли ИмяПараметра = "ВестиУчетМестонахожденияМедкарт" Тогда
		Возврат Ложь;		
	ИначеЕсли ИмяПараметра = "АвтоСозданиеМедкарт" Тогда
		Возврат Истина;		
	ИначеЕсли ИмяПараметра = "ИспользоватьЛабораторныеИсследования" Тогда
		Возврат Метаданные.Подсистемы.Найти("ЛабораторныеИсследования") <> Неопределено;
	ИначеЕсли ИмяПараметра = "РаботаСЗубнымиКартами" Тогда
		Возврат Ложь;
	ИначеЕсли ИмяПараметра = "ИспользуетсяРежимВводаПриемаПоОдномуШаблону" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ИспользоватьЛистыОжиданияЗаписи" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ВысотаСтрокиЖурналаЗаписи" Тогда
		Возврат 12;
	ИначеЕсли ИмяПараметра = "БазовыйКаталогСетевой" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "РежимОтбораЖурналаЗаписиПоМоделямРасписания" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ПоУмолчаниюПодборСубъектовВЖурналЗаписиПоСтруктуреОрганизации" Тогда
		Возврат 0;
	ИначеЕсли ИмяПараметра = "РазворачиватьДеревоСубъектовРасписанияПриПодбореВЖурналЗаписи" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "РазворачиватьДеревоМоделейРасписанияПриПодбореВЖурналЗаписи" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ФормироватьЖурналЗаписиБезОтбора" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ВключатьВЖурналЗаписиУчастниковБезМоделейРасписания" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ПредставлениеВЧекеККМОперацииПополненияБаланса" Тогда
		Возврат "Расчет по депозиту";
	ИначеЕсли ИмяПараметра = "ИспользоватьСтраховыеПолисы" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ИспользоватьПрофосмотры" Тогда
		Возврат Истина;
	ИначеЕсли ИмяПараметра = "ИспользоватьМедосмотрыСправки" Тогда
		Возврат Истина;
	Иначе
		Возврат Метаданные.РегистрыСведений.УчетнаяПолитика.Ресурсы[ИмяПараметра].Тип.ПривестиЗначение(Неопределено);
	КонецЕсли;	
	
КонецФункции

// Возвращает значение параметра расширенной(дополнительной) учетной политики по умолчанию.
//
// Параметры:
//  Параметр					 - Строка	 - параметр.
//  ПараметрыХранилищеЗначения	 - Массив	 - кеш списка параметров, хранимых как хранилище значения.
// 
// Возвращаемое значение:
//  Произвольный - определяется типом значения параметра.
//
Функция ПолучитьЗначениеПараметраУчетнойПолитикиРасширеннойПоУмолчанию(ИмяПараметра, Знач ПараметрыХранилищеЗначения = Неопределено) Экспорт
	
	Значение = Неопределено;
	
	УчетнаяПолитикаРасширенная = УправлениеНастройкамиПовтИсп.ПолучитьУчетнуюПолитикуРасширеннуюПоУмолчанию();
	
	Если УчетнаяПолитикаРасширенная.Свойство(ИмяПараметра) Тогда 
		Значение = УчетнаяПолитикаРасширенная[ИмяПараметра];
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Возвращает значение настройки пользователя
//
// Параметры:
//  Сотрудник	 - СправочникСсылка.Сотрудники	 - ссылка на элемент справочника "Сотрудники"
//  Настройка	 - Строка						 - имя предопределенного элемента настройки
//  Филиал		 - СправочникСсылка.Филиалы		 - Филиал, для которого требуется получить настройку.
// 
// Возвращаемое значение:
//  Произвольный.
//
Функция ПолучитьЗначениеСотрудникаПоУмолчанию(Сотрудник, Настройка, Знач Филиал = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		Филиал = Справочники.Филиалы.ПустаяСсылка();
	КонецЕсли;
	
	ЗаписьНастройки = РегистрыСведений.НастройкиСотрудников.СоздатьМенеджерЗаписи();
	ЗаписьНастройки.Сотрудник = Сотрудник;
	ЗаписьНастройки.Настройка = ПланыВидовХарактеристик.НастройкиСотрудников[Настройка];
	ЗаписьНастройки.Филиал = Филиал;
	ЗаписьНастройки.Прочитать();
	Если ЗаписьНастройки.Выбран() Тогда
		Возврат ЗаписьНастройки.Значение;
	ИначеЕсли ЗначениеЗаполнено(Филиал) Тогда
		ЗаписьНастройки.Сотрудник = Сотрудник;
		ЗаписьНастройки.Настройка = ПланыВидовХарактеристик.НастройкиСотрудников[Настройка];
		ЗаписьНастройки.Филиал = Справочники.Филиалы.ПустаяСсылка();
		ЗаписьНастройки.Прочитать();
		Если ЗаписьНастройки.Выбран() Тогда
			Возврат ЗаписьНастройки.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.НастройкиСотрудников[Настройка].Метаданные().Тип.ПривестиЗначение(Неопределено);
	
КонецФункции

// Возвращает значение параметра учетной политики филиала
//
// Параметры:
//  ИмяПараметра - Строка - имя параметра
//  Филиал		 - СправочникСсылка.Филиалы	 - Филиал, для которого требуется получить настройку.
// 
// Возвращаемое значение:
//  Произвольный - определяется типом значения параметра.
//
Функция ПолучитьПараметрУчетнойПолитикиФилиала(ИмяПараметра, Знач Филиал = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	КонецЕсли;
	
	мУчетнаяПолитикаФилиала = РегистрыСведений.УчетнаяПолитикаФилиалов.Выбрать(Новый Структура("Филиал",Филиал));
	
	Если мУчетнаяПолитикаФилиала.Следующий() Тогда
		Если ИмяПараметра = "ОсновнойПрейскурант" Тогда
			Если ЗначениеЗаполнено(мУчетнаяПолитикаФилиала[ИмяПараметра]) Тогда
				Возврат мУчетнаяПолитикаФилиала[ИмяПараметра];
			Иначе 
				Возврат ПолучитьЗначениеПараметраУчетнойПолитикиФилиалаПоУмолчанию(ИмяПараметра)
			КонецЕсли; 
		Иначе 
			Возврат мУчетнаяПолитикаФилиала[ИмяПараметра]; 
		КонецЕсли;	
	Иначе
		Возврат ПолучитьЗначениеПараметраУчетнойПолитикиФилиалаПоУмолчанию(ИмяПараметра)
	КонецЕсли;
	
КонецФункции

// Возвращает значение параметра учетной политики филиала по умолчанию
//
// Параметры:
//  ИмяПараметра - Строка - имя параметра
//
// Возвращаемое значение:
//  Произвольный - определяется типом значения параметра.
//
Функция ПолучитьЗначениеПараметраУчетнойПолитикиФилиалаПоУмолчанию(ИмяПараметра) Экспорт
	
	Если ИмяПараметра = "ОсновнойПрейскурант" Тогда
		Возврат ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант")
	ИначеЕсли 	ИмяПараметра = "ПрефиксМедицинскойКарты" Тогда                                    
		Возврат "";
	Иначе
		Возврат Метаданные.РегистрыСведений.УчетнаяПолитикаФилиалов.Ресурсы[ИмяПараметра].Тип.ПривестиЗначение(Неопределено);
	КонецЕсли;	
	
КонецФункции

// Функция возвращает значение прейскуранта для филиала, если не заполнен,
//  то значение основного прейскуранта из учетной политики.
//
// Параметры:
//  Филиал		 - СправочникСсылка.Филиалы	 - Филиал, для которого требуется получить настройку.
// 
// Возвращаемое значение:
//   СправочникСсылка.Прейскуранты.
//
Функция ПолучитьПрейскурантФилиала(Знач Филиал = Неопределено) Экспорт 
	
	Прейскурант = ПолучитьПараметрУчетнойПолитикиФилиала("ОсновнойПрейскурант", Филиал);

	Если Не ЗначениеЗаполнено(Прейскурант) Тогда
		Прейскурант = ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант")
	КонецЕсли;
	
	Возврат Прейскурант;
	
КонецФункции

// Фукнция возвращает цвет заявок в календаре по-умлочнию
//
// Возвращаемое значение:
// 	Цвет.
//
Функция ПолучитьЦветЗаявкиПоУмолчанию() Экспорт
	Возврат Новый Цвет(185,220,165);
КонецФункции

Функция ПолучитьЦветНерабочегоВременипоУмолчанию()
	Возврат Новый Цвет(255,245,220);	
КонецФункции

// Сохраняет значение параметра учетной политики.
//
// Параметры:
//  ИмяПараметра - Строка	 - имя параметра
//  Значение	 - Произвольный	 - значение, соответствующее параметру.
//
Процедура УстановитьЗначениеПараметраУчетнойПолитики(ИмяПараметра, Значение) Экспорт
	
	РесурсУП = Метаданные.РегистрыСведений.УчетнаяПолитика.Ресурсы.Найти(ИмяПараметра);
	Если РесурсУП <> Неопределено Тогда 
		
		Запись = РегистрыСведений.УчетнаяПолитика.СоздатьМенеджерЗаписи();
		Запись.Прочитать();
		Если Не РесурсУП.Тип.СодержитТип(Тип("ХранилищеЗначения")) Или 
			(РесурсУП.Тип.СодержитТип(Тип("ХранилищеЗначения")) И ТипЗнч(Значение) = Тип("ХранилищеЗначения")) 
		Тогда 
			Запись[ИмяПараметра] = Значение;
		Иначе
			Запись[ИмяПараметра] = Новый ХранилищеЗначения(Значение);
		КонецЕсли;
		Запись.Записать();
		
	Иначе	
		
		ИменаПараметровХранилищеЗначения = УправлениеНастройкамиПовтИсп.ПолучитьПараметрыУчетнойПолитикиРасширеннойХранилищеЗначений();	
		Если Метаданные.Перечисления.ПараметрыУчетнойПолитики.ЗначенияПеречисления.Найти(ИмяПараметра) <> Неопределено Тогда
			
			ПараметрРасширенный = Перечисления.ПараметрыУчетнойПолитики[ИмяПараметра]; 
			Запись = РегистрыСведений.УчетнаяПолитикаРасширенная.СоздатьМенеджерЗаписи();
			Запись.Параметр = ПараметрРасширенный;
			
			Если ИменаПараметровХранилищеЗначения.Найти(ИмяПараметра) <> Неопределено Тогда
				Запись.ХранилищеЗначения = ?(ТипЗнч(Значение) = Тип("ХранилищеЗначения"), Значение, Новый ХранилищеЗначения(Значение));
			Иначе
				Запись.Значение = Значение;
			КонецЕсли;
			Запись.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

// Требуется ли учет по филиалам
// 
// Возвращаемое значение:
//   Булево. 
//
Функция ТребуетсяУчетПоФилиалам() Экспорт
	
	Возврат ПараметрыСеанса.ИспользованиеРИБ Или ПараметрыСеанса.УчетПоНесколькимФилиалам;
	
КонецФункции

// Функция возвращает основной филиал пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи	 - пользователь.
// 
// Возвращаемое значение:
//   СправочникСсылка.Филиалы.
//
Функция ПолучитьФилиалПоУмолчаниюПользователя(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Филиал = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь,"ОсновнойФилиал");
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		Если Метаданные.ПланыОбмена.Найти("Полный") <> Неопределено Тогда
			Филиал = ПланыОбмена["Полный"].ЭтотУзел().Филиал;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Филиал;
	
КонецФункции

// Основная валюта базы
// 
// Возвращаемое значение:
//  СправочникСсылка.Валюты.
//
Функция ОсновнаяВалюта() Экспорт
	
	Валюта = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВалютаУчета");
  	Если Не ЗначениеЗаполнено(Валюта) Тогда
    	Валюта = Справочники.Валюты.Рубль;
	КонецЕсли;
	
	Возврат Валюта;
	
КонецФункции

// Возвращает краткое наименование валюты, указанной в учетной политике как основная.
//
// Возвращаемое значение: 
//	Строка - краткое наименование валюты.
//
Функция КраткоеНаименованиеОсновнойВалюты() Экспорт
	
	ВалютаУчета = УправлениеНастройками.ОсновнаяВалюта();
	Если ЗначениеЗаполнено(ВалютаУчета) Тогда
		Возврат ВалютаУчета.Наименование;
	Иначе
		Возврат "руб.";
	КонецЕсли;
	
КонецФункции 

#КонецОбласти
